import type { LevelData } from "./level1";

export const level4: LevelData = {
  width: 960,
  height: 720,
  playerStart: { x: 100, y: 360 },
  walls: [
    { x: 480, y: 16, w: 960, h: 32 },
    { x: 480, y: 704, w: 960, h: 32 },
    { x: 16, y: 360, w: 32, h: 720 },
    { x: 944, y: 360, w: 32, h: 720 },
    // Перегородка 1 (x=224): зазор сверху y=32–128
    { x: 224, y: 408, w: 32, h: 560 },
    // Перегородка 2 (x=416): зазор снизу y=592–688
    { x: 416, y: 312, w: 32, h: 560 },
    // Перегородка 3 (x=608): зазор сверху y=32–128
    { x: 608, y: 408, w: 32, h: 560 },
    // Перегородка 4 (x=800): зазор снизу y=592–688
    { x: 800, y: 312, w: 32, h: 560 },
  ],
  enemySpawns: [
    { type: "melee", x: 320, y: 360 },
    { type: "melee", x: 512, y: 360 },
    { type: "melee", x: 704, y: 360 },
    { type: "melee", x: 864, y: 360 },
  ],
};
